# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # RDCL
  - [-1, 1, Conv, [24, 7, 4, 3, 1, 1, False]]
  - [-1, 1, CReLu, []]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]
  - [-1, 1, Conv, [64, 5, 2, 2, 1, 1, False]]
  - [-1, 1, CReLu, []]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]
  # MSCL
  - [-1, 1, InceptionV2, []]
  - [-1, 1, InceptionV2, []]
  - [-1, 1, InceptionV2, []]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, Conv, [256, 3, 2, 1]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, Conv, [256, 3, 2, 1]]

# YOLOv8.0n head
head:
  - [[8, 10, 12], 1, Detect, [nc]] # Detect(P3, P4, P5)
